#include<iostream>
#include<time.h>

int main() {
	int x = (std::rand() % (100)) + 1;
	int y = 0;
	std::cout << "猜数组游戏\n"
	<< "------开始--------\n"
	<< "请猜一个1-100内的数字:";
	while (y != x) {
		std::cin >> y;
		if (y > x) {
			std::cout << "你的数字猜大了\n"
			<< "-----失败------\n"
			<< "请重新开始游戏\n";
			std::cout << "猜数组游戏\n"
			<< "------开始--------\n"
			<< "请猜一个1-100内的数字:";
		}
		else {
			std::cout << "你的数字猜小了\n"
				<< "-----失败------\n"
				<< "请重新开始游戏\n";
			std::cout << "猜数组游戏\n"
				<< "------开始--------\n"
				<< "请猜一个1-100内的数字:";
		}
	}
	std::cout << "\n------恭喜通关游戏-------";
}
